cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addTransImmedPat.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
<soapenv:Header/>
   <soapenv:Body>
    <ns:addTransPattern sequence="?">
      <transPattern>
         <pattern>92.!</pattern>
         <description>Immediate (I) precedence</description>
         <usage>Translation</usage>
         <routePartitionName uuid="?">Immediate_PT</routePartitionName>
         <provideOutsideDialtone>true</provideOutsideDialtone>
         <patternUrgency>true</patternUrgency>
         <patternPrecedence>Immediate</patternPrecedence>
         <callingSearchSpaceName uuid="?">Internal_External_CSS</callingSearchSpaceName>
      </transPattern>
    </ns:addTransPattern>
  </soapenv:Body>
</soapenv:Envelope>

